iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H750B-DK/stm32h750b_discovery_audio.c
/** @defgroup STM32H750B_DK_AUDIO_IN_Exported_Functions AUDIO IN Exported Functions
  * @{
  */

/**
  * @brief  Initialize wave recording.
  * @param  Instance  AUDIO IN Instance. It can be:
  *       - 0 when SAI is used
  *       - 1 if SAI PDM is used
  * @param  AudioInit Init structure
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Store the audio record context */
    Audio_In_Ctx[Instance].Device = AudioInit->Device;
    Audio_In_Ctx[Instance].ChannelsNbr = AudioInit->ChannelsNbr;
    Audio_In_Ctx[Instance].SampleRate = AudioInit->SampleRate;
    Audio_In_Ctx[Instance].BitsPerSample = AudioInit->BitsPerSample;
    Audio_In_Ctx[Instance].Volume = AudioInit->Volume;
    Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;

    if (Instance == 0U)
    {
      /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
      if (MX_SAI2_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
      {
        ret = BSP_ERROR_CLOCK_FAILURE;
      }
      else
      {
        haudio_in_sai.Instance = AUDIO_IN_SAIx;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspInit(&haudio_in_sai);
#else
        /* Register the default SAI MSP callbacks */
        if(Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
        {
          if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        if (ret == BSP_ERROR_NONE)
        {
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */

          MX_SAI_Config_t mx_config;

          mx_config.MonoStereoMode = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
          mx_config.DataSize = SAI_DATASIZE_16;
          mx_config.FrameLength = 64;
          mx_config.ActiveFrameLength = 32;
          if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_32B)
          {
            mx_config.DataSize = SAI_DATASIZE_32;
            mx_config.FrameLength = 128;
            mx_config.ActiveFrameLength = 64;
          }
          mx_config.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
          switch (AudioInit->Device)
          {
          case AUDIO_IN_DEVICE_ANALOG_MIC:
            mx_config.SlotActive = SAI_SLOTACTIVE_0;
            break;
          case AUDIO_IN_DEVICE_DIGITAL_MIC:
          default:
            mx_config.SlotActive = CODEC_AUDIOFRAME_SLOT_13;
            break;
          }

          /* Prepare haudio_in_sai handle */
          haudio_in_sai.Instance = SAI2_Block_B;
          mx_config.AudioFrequency = Audio_In_Ctx[Instance].SampleRate;
          mx_config.AudioMode = SAI_MODESLAVE_RX;
          mx_config.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
          mx_config.Synchro = SAI_SYNCHRONOUS;
          mx_config.SynchroExt = SAI_SYNCEXT_DISABLE;

          if (MX_SAI2_Block_B_Init(&haudio_in_sai, &mx_config) != HAL_OK)
          {
            /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            /* Prepare haudio_out_sai handle */
            haudio_out_sai.Instance = SAI2_Block_A;
            mx_config.AudioMode = SAI_MODEMASTER_TX;
            mx_config.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
            mx_config.OutputDrive = SAI_OUTPUTDRIVE_ENABLE;
            mx_config.Synchro = SAI_ASYNCHRONOUS;
            mx_config.SynchroExt = SAI_SYNCEXT_DISABLE;
            mx_config.SlotActive = CODEC_AUDIOFRAME_SLOT_0123;
            if (MX_SAI2_Block_A_Init(&haudio_out_sai, &mx_config) != HAL_OK)
            {
              /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
          if (ret == BSP_ERROR_NONE)
          {
            /* Register SAI TC, HT and Error callbacks */
            if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1U) */
#if (USE_AUDIO_CODEC_WM8994 == 1U)
          if (ret == BSP_ERROR_NONE)
          {
            /* Initialize the codec internal registers */
            if (WM8994_Probe() == BSP_ERROR_NONE)
            {
              WM8994_Init_t codec_init;

              /* Fill codec_init structure */
              codec_init.Frequency = AudioInit->SampleRate;
              codec_init.OutputDevice = WM8994_OUT_NONE;
              if (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_MIC)
              {
                codec_init.InputDevice = WM8994_IN_LINE1;
                codec_init.OutputDevice = AUDIO_OUT_DEVICE_HEADPHONE;
              }
              else /* (AudioInit->Device == AUDIO_IN_DEVICE_DIGITAL_MIC) */
              {
                codec_init.InputDevice = WM8994_IN_MIC2;
              }
              codec_init.Resolution = (AudioInit->BitsPerSample == AUDIO_RESOLUTION_32B) ? 3 : 0;

              /* Convert volume before sending to the codec */
              codec_init.Volume = VOLUME_IN_CONVERT(AudioInit->Volume);

              /* Initialize the codec internal registers */
              if (Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
              {
                ret = BSP_ERROR_COMPONENT_FAILURE;
              }
            }
          }
#endif /*USE_AUDIO_CODEC_WM8994 == 1)*/
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
        }
#endif
      }
    }
    else /* (Instance == 1U) */
    {
      /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
      if(MX_SAI4_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
      {
        ret = BSP_ERROR_CLOCK_FAILURE;
      }
      else
      {
        haudio_in_sai.Instance = AUDIO_IN_SAI_PDMx;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0U)
        SAI_MspInit(&haudio_in_sai);
#else
        /* Register the default SAI MSP callbacks */
        if(Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
        {
          if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }

        if(ret == BSP_ERROR_NONE)
        {
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0U) */
          MX_SAI_Config_t mx_config;

